#include "Enemy.h"

using namespace std;


/// --------------------------------------------------------
///		　メンバ関数ポインタテーブルの実態を定義
/// --------------------------------------------------------
Enemy::StateFunc Enemy::stateFuncTable[] = {
	&Enemy::Approach, // 接近
	&Enemy::Shoot,	  // 射撃
	&Enemy::Retreat   // 離脱
};


/// --------------------------------------------------------
///					コンストラクタ
/// --------------------------------------------------------
Enemy::Enemy() : currentState(0){}


/// --------------------------------------------------------
///					状態遷移を行う関数
/// --------------------------------------------------------
void Enemy::UpdateState()
{
	// 現在の状態を実行
	(this->*stateFuncTable[currentState])();

	// 状態を進める（接近処理 -> 射撃処理 -> 離脱処理）
	currentState = (currentState + 1) % 3;
}


/// --------------------------------------------------------
///						接近状態処理
/// --------------------------------------------------------
void Enemy::Approach()
{
	cout << "Enemy is Approating" << endl;
}


/// --------------------------------------------------------
///						射撃状態処理
/// --------------------------------------------------------
void Enemy::Shoot()
{
	cout << "Enemy is Shooting" << endl;
}


/// --------------------------------------------------------
///						離脱状態処理
/// --------------------------------------------------------
void Enemy::Retreat()
{
	cout << "Enemy is Retreating" << endl;
}
